[
  {
    "Id": 2,
    "Name": "Marvel Legends Series 3.75\" Venom Action Figure",
    "Description": "Joined with reporter Eddie Brock the symbiote Venom has only one plan: getting revenge on the amazing Spider-Man! With over 80 years of entertainment history Marvel has become a cornerstone of fan collections around the world. With the Marvel Legends Series fan favorite Marvel Comic Universe and Marvel Cinematic Universe characters are designed with premium detail and articulation for posing and display in collections. From figures to vehicles to premium roleplay items the Marvel Legends Series offers elite character-inspired product for Marvel fans and collectors. Additional figures each sold separately. Subject to availability. Copyright 2021 MARVEL. Hasbro and all related terms are trademarks of Hasbro. • Fans collectors and kids alike can enjoy this 3.75-inch-scale classic Retro 375 Collection Venom figure inspired by the character from the Marvel comic • This Retro 375 Collection figure has premium design detail and articulation for posing and display in a Marvel collection. • This quality 3.75-inch Legends Series Retro 375 Collection Venom figure features multiple points of articulation and is a great addition to any action figure collection. • Look for other Hasbro Marvel Legends Series Retro 375 Collection figures (each sold separately) with Marvel comic-inspired characters including Dark Phoenix Wolverine Marvel's Falcon and Mr. Fantastic • 4 years and up",
    "Price": 10.99,
    "PictureUrl": "http://slimages.macys.com/is/image/MCY/products/0/optimized/23050312_fpx.tif",
    "CategoryId": 1,
    "BrandId": 2
  },
  {
    "Id": 3,
    "Name": "Marvel Spidey and His Amazing Friends Supersized Spidey Action Figure",
    "Description": "\"It's Spidey time! Spidey and His Amazing Friends Supersized Spidey action figure is made for big imaginations. At 9 inches tall this large-scale poseable Super Hero action figure is big friendly and ready to play! Kids can attach the included web accessory to the figure's wrist and move the Spidey figure's head and arms into fun action poses to recreate favorite scenes from the preschool Marvel animated show on Disney Junior. Look for Supersized Ghost-Spider and Supersized Miles Morales: Spider-Man action figures (each sold separately subject to availability) for more Spidey fun! These Spidey toys make great gifts for kids ages 3 and up who love the Super Hero adventures of the Spidey Team. • \"SUPER HERO ACTION FIGURE: Web-out with the Spidey and His Amazing Friends Supersized Spidey Action Figure! This 9-inch-tall figure comes with a web accessory for ultimate imaginative play \" • \"POSEABLE HEADS AND ARMS: Spidey action figure's head and arms move so preschoolers can move them into dynamic action poses that recreate the excitement of the TV show \" • \"ATTACHABLE WEB ACCESSORY: Kids can attach the included web accessory to the Spidey figure's wrist so he can \"web out\" just like in the preschool animated show on Disney Junior \" • \"GREAT GIFT FOR SUPER HERO FANS: These preschool Marvel action figures make awesome holiday or birthday presents for girls and boys ages 3 and up who love Super Hero toys \" • KEEP THE ACTION GOING: Look for Supersized Miles Morales: Spider-Man and Supersized Ghost-Spider action figures (each sold separately subject to availability) for even more Spidey Team fun",
    "Price": 11.99,
    "PictureUrl": "http://slimages.macys.com/is/image/MCY/products/0/optimized/21909102_fpx.tif",
    "CategoryId": 1,
    "BrandId": 2
  },
  {
    "Id": 4,
    "Name": "Star Wars Plush Toy, Grogu Soft Doll from The Mandalorian, 8-in Figure",
    "Description": "Fully embrace the cuteness of the 50-year-old Yoda species with this adorable 8-inch plush toy. He may look like a Baby Yoda but this lovable creature is referred to as \"The Child. • This 8-inch The Child plush toy will capture the hearts of Star Wars fans everywhere! • Inspired by the Disney+ series The Mandalorian the adorable figure with green skin big ears and large eyes looks like a baby Yoda but is called \"The Child.\" • The toy plush has a soft body plus a sturdy base filled with beans perfect for cuddling or display as a collectible • Character wears his robes as seen in the show. • Star Wars fans will love taking on the role of The Mandalorian Bounty Hunter and caring for The Child on their own!",
    "Price": 14.99,
    "PictureUrl": "http://slimages.macys.com/is/image/MCY/products/0/optimized/17912602_fpx.tif",
    "CategoryId": 2,
    "BrandId": 3
  },
  {
    "Id": 5,
    "Name": "Star Wars Retro Figure - Darth Vader",
    "Description": "Obi-Wan Kenobi is set years after the events of Star Wars: Revenge of the Sith where Kenobi faced the corruption of his friend and Jedi apprentice Anakin Skywalker Kids and collectors can imagine the biggest battles and missions in the Star Wars saga with figures from Star Wars Retro Collection! With exquisite features and decoration this series embodies the quality and realism that Star Wars devotees love. Star Wars Retro Collection includes figures from the 40-plus-year legacy of the Star Wars Galaxy including movies and live-action series. (Additional products each sold separately. Subject to availability.) The 3.75-inch-scale Retro Collection figure is detailed to look like the Darth Vader (The Dark Times) character from Star Wars: Obi-Wan Kenobi live-action series on Disney Plus featuring design and detailing inspired by 1970s Star Wars figures. • The Star Wars Retro Collection features design and detailing inspired by the original 1970s Star Wars figures • The Star Wars Retro Collection 3.75-inch-scale figures feature classic Kenner branding as well as packaging treated with a weathered look (Each sold separately. Subject to availability.) • Fans and collectors can imagine scenes from the Star Wars Galaxy with this premium Darth Vader (The Dark Times) toy inspired by the live-action series on Disney Plus • This Star Wars Retro Collection action figure comes with 1 entertainment-inspired accessory and makes a great addition to any Star Wars collection • Star Wars fans and collectors can display this figure featuring five points of articulation in their action figure and vehicle collection",
    "Price": 11.99,
    "PictureUrl": "http://slimages.macys.com/is/image/MCY/products/0/optimized/23050232_fpx.tif",
    "CategoryId": 2,
    "BrandId": 3
  },
  {
    "Id": 6,
    "Name": "LEGO® Super Mario Adventures Starter Course, 231 Pieces",
    "Description": "Kids unlock unlimited action-packed challenges with this LEGO Super Mario Starter Course featuring a highly interactive LEGO Mario figure. • Overall product dimension- 12.48\" L x 10.32\" W x 3.54\" H • Overall product weight- 1.11 lbs • Suitable for ages- 6 and up • Set includes- 231 LEGO pieces • Fans can begin exploring the fun-packed LEGO Super Mario LEGO universe with this Adventures with Mario Starter Course featuring 7 action bricks for different interactions with the LEGO Mario LEGO figure • LEGO Mario LEGO has a color sensor plus LCD screens in his eyes mouth and belly to display many different instant reactions to movement also included is a speaker that plays iconic sounds and music • LEGO Mario LEGO collects virtual coins as he runs and jumps from the Start Pipe to the Goal Pole via LEGO bricks cloud platforms the Block and clashes with the Goomba figure and Bowser Jr • This LEGO toy playset makes a cool gift for kids aged 6 and above • Rearrange the Starter Course and combine with LEGO Super Mario LEGO Expansion Sets to create more challenging levels and games to play with and against friends • The LEGO Mario LEGO figure is powered by 2 x AAA batteries (not included) • Kids will love the free LEGO Super Mario LEGO app which has building instructions inspiration for fun creative ways to play • Great for solo or group play interactive LEGO Super Mario LEGO toy building sets bring a family-favorite character to life in a unique way • LEGO meets the highest industry standards • LEGO building bricks meet the highest global safety and quality standards • Warning- choking hazard- contains small parts not suitable for children under 3 years",
    "Price": 59.99,
    "PictureUrl": "http://slimages.macys.com/is/image/MCY/products/0/optimized/20951831_fpx.tif",
    "CategoryId": 3,
    "BrandId": 1
  },
  {
    "Id": 7,
    "Name": "LEGO® Star Wars Dagobah Jedi Training Diorama, 1000 Piece",
    "Description": "Feel the Force as you recreate the Jedi training scene from Star Wars The Empire Strikes Back with this build-and-display diorama for adults. • Product dimension - 15.04\" L x 10.32\" W x 3.7\" H • Model dimension - 6\" H x 11\" W x 6.5\" D • Weight - 2.42 lbs • Set includes - 1000 pieces which includes 2 LEGO® Star Wars minifigures and a LEGO® droid figure - Luke Skywalker and Yoda with his walking stick plus R2-D2 • For ages 18 and above • Detailed Dagobah Jedi Training Diorama 75330 - channel the focus of Jedi Master Yoda as you recreate an iconic Star Wars The Empire Strikes Back scene with LEGO® bricks • Made for display - build Yoda's hut on the planet Dagobah plus the wing of Luke Skywalker's X-wing sticking out of the swamp attach a plaque reading 'Do or do not there is no try' as said by Yoda • Build your collection - this set is part of a series of collectible LEGO® Star Wars build-to-display diorama models each depicting a beloved Star Wars scene • Gift idea - treat yourself or give this 1000-piece set as a holiday gift or birthday present to an adult Star Wars fan passionate LEGO® builder or collector of LEGO® Star Wars dioramas • Brick-built Star Wars memorabilia designed to spark nostalgia • Step-by-step guide - are you a newcomer to LEGO® building sets no problem there are illustrated instructions in the box to help you build with the confidence of Jedi Master Yoda • From a galaxy far far away to your living room - LEGO® Star Wars sets for adults are designed for you the discerning hobbyist who enjoys hands-on creative projects to relax and recharge • Premium quality - since 1958 LEGO® components have met rigorous industry standards to ensure they are consistent compatible and connect securely • Safety compliance - LEGO® bricks and pieces are dropped heated crushed twisted and analyzed to make sure that they comply with strict global safety standards • Warning - choking hazard - contains small parts not suitable for children under 3 years",
    "Price": 89.99,
    "PictureUrl": "http://slimages.macys.com/is/image/MCY/products/0/optimized/22356307_fpx.tif",
    "CategoryId": 3,
    "BrandId": 1
  },
  {
    "Id": 8,
    "Name": "League of Legends, 6\" Wukong Collectible Figure",
    "Description": "Bring your favourite League of Legends Champion home with the Official League of Legends Wukong 6\" figure. • WARNING - CHOKING HAZARD-contains small parts not suitable for children under 3 years • Age 12 years and above • Set includes - League of Legends Wukong figure 1 Enchanted staff accessory • Product dimensions - 8.5\" L x 2.38\" W x 10\" H • Product weight - 0.74 lbs • Official League of Legends- collect the League of Legends champion Wukong - the Monkey King. He uses his strength agility and intelligence to confuse opponents a premium figure worthy of champions • Premium Wukong figure- crafted with extreme details through mold finishes and sculpted textures. Premium paint and quality material finishes to bring your champion to life • 18 points of articulation- the League of Legends collectible figure has 18 points of articulation for poseability and stances • Display base and accessory- includes game-inspired premium accessory and a thematic figure base. Wukong comes with high-quality enchanted staff accessory • Assembly is not required",
    "Price": 20.99,
    "PictureUrl": "http://slimages.macys.com/is/image/MCY/products/0/optimized/23844897_fpx.tif",
    "CategoryId": 2,
    "BrandId": 4
  },
  {
    "Id": 9,
    "Name": "Batman 4 Inch Vehicle Batwing with Figure",
    "Description": "The Batman 4-inch figure is highly detailed with 11 points of articulation for dynamic battle poses! When you?re ready to battle • WARNING: CHOKING HAZARD?Contains small parts. Not suitable for children under 3 years. • This Brand by The Global Toy and Entertainment Company Spin Master has been designed developed manufactured and brought to market to bring joy to children around the world. • Spin Master develops their brands with innovation. • Spin Master pays special attention to show the best features and details of a brand online and are dedicated to supporting their products.",
    "Price": 13.99,
    "PictureUrl": "http://slimages.macys.com/is/image/MCY/products/0/optimized/20272040_fpx.tif",
    "CategoryId": 4,
    "BrandId": 5
  },
  {
    "Id": 10,
    "Name": "Batman Batmobile with 4? Batman Figure, Lights and Sounds, The Batman Movie Collectible",
    "Description": "Speed into action with the Batman Batmobile ? featuring authentic movie-style sculpting over 15 sounds effects and LED lights that will bring your Batman adventures to life! Create epic Batman adventures with the included 4-inch Batman figure! Use your imagination and recreate your favorite Batman Movie moments. The Batmobile can fit the included 4-inch Batman figure with 11 points of articulation and cloth cape. Push down on the engine to activate the engine lights and sound effects! Roll the Batmobile to change the lights and sounds and into Gotham City! This iconic Batmobile is a must-have toy for boys girls and Batman fans ages 3 and up! DC fans of all ages love Batman action figure. With a range of figures to collect you can now expand your Batman collection with Batman Selina Kyle The Penguin and more (each sold separately). Collect all your favorite characters from The Batman movie. Engage your imagination and create your own Batman battles. Bring your favorite Batman Movie moments to life with the Batman Batmobile! • WARNING: CHOKING HAZARD?contains small parts; not suitable for children under 3 years • LIGHT UP BATMAN BATMOBILE: Keep the streets of Gotham City safe with the Batman Batmobile! This sleek Batman vehicle features LED engine lights awesome headlights and undercarriage residual glow! • SOUNDS AND AUTHENTIC MOVIE-STYLING: The detailed deco and movie-style sculpting brings the Batmobile to life. Push down on the engine to activate over 15 accurate engine sounds just like in the Batman Movie! • INCLUDES 4-INCH BATMAN FIGURE: Includes 4-inch Batman figure with cloth cape detailed sculpting and authentic movie styling. With 11 points of articulation it's easy to pose the Batman action figure into a variety of dynamic poses! • OFFICIAL THE BATMAN MOVIE COLLECTIBLE: Complete your Batman collection with Batman Selina Kyle and The Penguin figures (each sold separately)! • Includes: 1 Vehicle 1 Figure 3 AAA Batteries (Included)",
    "Price": 39.99,
    "PictureUrl": "http://slimages.macys.com/is/image/MCY/products/0/optimized/21707475_fpx.tif",
    "CategoryId": 4,
    "BrandId": 5
  },
  {
    "Id": 11,
    "Name": "Star Wars Retro Collection Obi-Wan Kenobi: Wandering Jedi",
    "Description": "Obi-Wan Kenobi is set years after the events of Star Wars: Revenge of the Sith where Kenobi faced the corruption of his friend and Jedi apprentice Anakin Skywalker Kids and collectors can imagine the biggest battles and missions in the Star Wars saga with figures from Star Wars Retro Collection! With exquisite features and decoration this series embodies the quality and realism that Star Wars devotees love. Star Wars Retro Collection includes figures from the 40-plus-year legacy of the Star Wars Galaxy including movies and live-action series. (Additional products each sold separately. Subject to availability.) The 3.75-inch-scale Retro Collection figure is detailed to look like the Obi-Wan Kenobi (Wandering Jedi) character from Star Wars: Obi-Wan Kenobi live-action series on Disney Plus featuring design and detailing inspired by 1970s Star Wars figures. • The Star Wars Retro Collection features design and detailing inspired by the original 1970s Star Wars figures • The Star Wars Retro Collection 3.75-inch-scale figures feature classic Kenner branding as well as packaging treated with a weathered look (Each sold separately. Subject to availability.) • Fans and collectors can imagine scenes from the Star Wars Galaxy with this premium Obi-Wan Kenobi (Wandering Jedi) toy inspired by the live-action series on Disney Plus • This Star Wars Retro Collection action figure comes with 2 entertainment-inspired accessories and makes a great addition to any Star Wars collection • Star Wars fans and collectors can display this figure featuring five points of articulation in their action figure and vehicle collection",
    "Price": 11.99,
    "PictureUrl": "http://slimages.macys.com/is/image/MCY/products/0/optimized/23050241_fpx.tif",
    "CategoryId": 2,
    "BrandId": 3
  },
  {
    "Id": 12,
    "Name": "League of Legends, Official 6\" Ashe Collectible Figure",
    "Description": "Bring your favourite League of Legends Champion home with the Official League of Legends Ashe 6\" figure. • WARNING - CHOKING HAZARD-contains small parts not suitable for children under 3 years • Age 14 years and above • Set includes - League of Legends Ashe figure 1 bow 1 crystal arrow accessory 3 regular arrows 1 quiver accessory • Product dimensions - 8.5\" L x 2.38\" W x 10\" H • Product weight - 0.66 lbs • Official League of Legends- collect the official League of Legends champion Ashe - The Frost Archer iceborn warmother of the avarosan tribe Ashe is a premium figure worthy of champions • Premium 6\" Ashe figure- crafted with extreme details through mold finishes and sculpted textures. Premium paint and quality material finishes to bring your champion to life • 18 points of articulation- the League of Legends collectible figure has 18 points of articulation for poseability and stances • 2 epic accessories- includes 2 game-inspired premium bow and arrow accessories and thematic figure base. Accessorize ashe with bow crystal arrows regular arrows and quiver • Assembly is not required",
    "Price": 20.99,
    "PictureUrl": "http://slimages.macys.com/is/image/MCY/products/0/optimized/23844864_fpx.tif",
    "CategoryId": 2,
    "BrandId": 4
  },
  {
    "Id": 13,
    "Name": "Clip N Go Belt Set Poke Ball Set",
    "Description": "Each set includes one 2\" in-scale figure 2 Poké Balls and one adjustable Clip 'N' Go belt that can hold up to 6 Clip 'N' Go Poké Balls other Poké Balls sold separately. Fits other 2\" Battle Figures sold separately. Gotta Catch 'Em All ? Suitable for ages 4 years and up. • WARNING: CHOKING HAZARD?Contains small parts. Not suitable for children under 3 years. • 1 2\" figure • 2 Poke Balls • 1 adjustable Clip N Go Belt • Ages 4+",
    "Price": 21.99,
    "PictureUrl": "http://slimages.macys.com/is/image/MCY/products/0/optimized/23371945_fpx.tif",
    "CategoryId": 2,
    "BrandId": 6
  },
  {
    "Id": 14,
    "Name": "Pokemon Carry Case Volcano Playset",
    "Description": "A new location from the show and games connect with all other carry case playsets folds easily into a backpack. • Product dimension - 12.01\" L x 6.26\" W x 7.99\" H • Product weight - 1.9 lbs • Set includes - 1 play • Over 10 exciting features • For ages 4 years and above • WARNING- CHOKING HAZARD-Contains small parts Not suitable for children under 3 years",
    "Price": 39.99,
    "PictureUrl": "http://slimages.macys.com/is/image/MCY/products/0/optimized/22603741_fpx.tif",
    "CategoryId": 2,
    "BrandId": 6
  },
  {
    "Id": 15,
    "Name": "Marvel Spider-Man Bend and Flex Action Figure",
    "Description": "Twist Turn Flex your power! Kids can bend flex pose and play with their favorite Marvel Super Heroes with these super agile Spider-Man Bend and Flex Figures! Collect characters inspired by Marvel Universe with a twist-each sold separately -These stylized Super Hero action figures have bendable arms and legs that can bend and hold in place for the perfect pose! There's plenty of heroic daring and dramatic action when kids shape their Bend and Flex figures into plenty of playful poses. • BEND Epic fun with twists and turns This 6-inch Bend and Flex figure has bendable arms and legs that can be twisted and flexed into tons of imaginative poses! • FLEX Have fun showing off and twisting this figure into imaginative new action poses. Bend and Flex figures definitely break the mold when it comes to adaptable action poses. • PICK YOUR POSE Hold that powerful pose! Each bendable figure also includes an accessory to enhance the figure in that perfect pose • COLLECT OTHER BEND AND FLEX FIGURES: Collect other Spider-Man Bend and Flex figures for flex-tastic fun! Additional figures sold separately. Subject to availability.",
    "Price": 6.99,
    "PictureUrl": "http://slimages.macys.com/is/image/MCY/products/0/optimized/19116683_fpx.tif",
    "CategoryId": 1,
    "BrandId": 2
  },
  {
    "Id": 16,
    "Name": "LEGO? Marvel Spidey and His Amazing Friends Spider-Man Web quarters Hangout Building Kit, 155 Pieces",
    "Description": "Even web slingers need to unwind! Help little builders make the ultimate hangout HQ (Headquarters) with the LEGO Marvel Spidey and his amazing friends Spider-Man web quarters hangout (10784) construction toy. • Product dimension - 15.04\" L x 10.32\" W x 2.22\" H • Weight - 1.4 lbs • Set includes - Spider-Man Ghost-Spider Miles Morales Ms. Marvel and super villain Green Goblin minifigures plus Trace-E the Ghost Copter and a 2-in1 Goblin car • For ages 4 and above • Building elements construction bricks instructions • Inspire and develop the builders of tomorrow • Batteries not required • Super-Hero hangout for kids delight them and their friends with Spider-Man web quarters hangout (10784) the place web-slingers unwind after a hard day's crime-fighting • Spider-Man set for creative play - kids can shoot hoops with Spider-Man dance with Ghost-Spider make art with Miles Morales play video games with Ms. Marvel or trap Goblin in a buildable web • Details bring the play to life - creative accessories such as a pumpkin trick pizza guitar 2 webs with strings brush paint palette and ball spark hours of endless fun • Gift for creative kids - fun Super-Hero gift for kids who love the Disney plus TV show Spidey and his amazing friends • A build to be proud of - the HQ (Headquarters) measures over 8.5\" high and 10\" wide making a colorful display that will impress friends who come round to join in the Super-Hero play • Features for fuss-free building - sets come with starter bricks to get kids building fast. Simple picture instructions mean there's no barrier to building even for kids just learning to read • Extend the play - compatible with other SKUs (Stock Keeping Unit) from LEGO Marvel Spidey and his amazing friends sets for even more action-packed play • A history of high standards - LEGO construction toys satisfy stringent industry quality tests to ensure they are consistent compatible and connect and pull apart it's been that way since 1958 • Safety guaranteed - this LEGO Marvel buildable toy meets rigorous global safety standards to ensure a safe play experience • Warning - choking hazard - contains small parts. Not suitable for children under 3 years",
    "Price": 49.99,
    "PictureUrl": "http://slimages.macys.com/is/image/MCY/products/0/optimized/21735083_fpx.tif",
    "CategoryId": 1,
    "BrandId": 1
  },
  {
    "Id": 17,
    "Name": "BATMAN, 12-Inch THE JOKER Action Figure Toy, Kids Toys for Boys Aged 3 and up",
    "Description": "Create your own epic superhero and supervillain adventures with the BATMAN 12-Inch Action Figures! Each action figure features 11 points of articulation and detailed comic styling that brings your favorite BATMAN heroes and villains to life! Team up with the Dynamic Duo of BATMAN and ROBIN and help rid GOTHAM CITY of its most sinister villains and criminals like THE JOKER and HARLEY QUINN. Engage your imagination and pose your DC action figures as you play out your own BATMAN figure storylines and battles! With a range of figures to collect expand your BATMAN action figure collection with BATMAN ROBIN THE JOKER and HARLEY QUINN (each sold separately). Protect GOTHAM CITY with the BATMAN 12-Inch Action Figures for boys and girls! • WARNING: CHOKING HAZARD?contains small parts; not suitable for children under 3 years • 12-INCH ACTION FIGURE: With 11 points of articulation it's easy to pose this 12-inch JOKER action figure into a variety of dynamic action poses. Create your own epic good vs. evil adventures! • AUTHENTIC COMIC STYLING: This articulated action figure is highly detailed featuring comic styling that brings your favorite BATMAN superheroes and supervillains to life! • COLLECT THEM ALL: Bring the excitement and adventure of BATMAN toys home! Add heroes and villains like BATMAN ROBIN THE JOKER and HARLEY QUINN toys to your action figure collection (each sold separately). • The BATMAN 12-Inch Collectible Action Figures make a great gift for fans and collectors aged 3 and up. Save GOTHAM with the BATMAN 12-Inch Action Figures! • Includes: 1 Figure",
    "Price": 12.99,
    "PictureUrl": "http://slimages.macys.com/is/image/MCY/products/0/optimized/21707546_fpx.tif",
    "CategoryId": 1,
    "BrandId": 5
  },
  {
    "Id": 18,
    "Name": "Star Wars Mission Fleet Anakin Skywalker Barc Speeder Strike Toy",
    "Description": "The 2.5\" scale Mission Fleet figure is detailed to look like the Anakin Skywalker character from the Star Wars - the Clone Wars animated series featuring pose able arms and legs as well as a detachable Lightsaber accessory. • WARNING: CHOKING HAZARD - Small parts. Not for children under 3 years • Ages 4 and up • Includes - figure and accessory • Product dimension - 2\" L x 8\" W x 7.88\" H • Product weight - 0.34 lbs • Anakin Skywalker - Anakin Skywalker had the potential to become one of the most powerful Jedi ever and was believed by some to be the prophesied chosen one who would bring balance to the force • Barc speeder strike - boys and girls ages 4 and up will love pretending to race into battle alongside Anakin skywalker during the clone wars with the Anakin skywalker barc speeder strike figure and vehicle featuring a repositionable sidecar • Iconic star wars character - this Anakin skywalker figure features multiple points of articulation as well as design and detail inspired by the star wars - the clone wars animated series • Figure dimension - 2.5\" • Series-based character-inspired accessories - this star wars mission fleet action figures come with a detachable entertainment-inspired lightsaber accessory • Collectible toys - look for other star wars mission fleet figures and vehicles to collect swap with friends or give as gifts (each sold separately. Subject to availability.) • Star Wars products are produced by Hasbro under license from Lucasfilm Ltd • Hasbro and all related terms are trademarks of Hasbro",
    "Price": 16.99,
    "PictureUrl": "http://slimages.macys.com/is/image/MCY/products/0/optimized/23919206_fpx.tif",
    "CategoryId": 2,
    "BrandId": 3
  },
  {
    "Id": 19,
    "Name": "Star Wars Retro Collection Obi-Wan Kenobi: Ned-B",
    "Description": "Obi-Wan Kenobi is set years after the events of Star Wars: Revenge of the Sith where Kenobi faced the corruption of his friend and Jedi apprentice Anakin Skywalker Kids and collectors can imagine the biggest battles and missions in the Star Wars saga with figures from Star Wars Retro Collection! With exquisite features and decoration this series embodies the quality and realism that Star Wars devotees love. Star Wars Retro Collection includes figures from the 40-plus-year legacy of the Star Wars Galaxy including movies and live-action series. (Additional products each sold separately. Subject to availability.) The 3.75-inch-scale Retro Collection figure is detailed to look like the NED-B character from Star Wars: Obi-Wan Kenobi live-action series on Disney Plus featuring design and detailing inspired by 1970s Star Wars figures. • The Star Wars Retro Collection features design and detailing inspired by the original 1970s Star Wars figures • The Star Wars Retro Collection 3.75-inch-scale figures feature classic Kenner branding as well as packaging treated with a weathered look (Each sold separately. Subject to availability.) • Fans and collectors can imagine scenes from the Star Wars Galaxy with this premium NED-B toy inspired by the live-action series on Disney Plus • This Star Wars Retro Collection action figure comes with 1 entertainment-inspired accessory and makes a great addition to any Star Wars collection • Ages 4 and up",
    "Price": 11.99,
    "PictureUrl": "http://slimages.macys.com/is/image/MCY/products/0/optimized/23050211_fpx.tif",
    "CategoryId": 2,
    "BrandId": 3
  },
  {
    "Id": 20,
    "Name": "Star Wars Rocket Launching Boba Fett Feature Plush",
    "Description": "Fans of Star Wars? will love this awesome 12\"-tall Boba Fett? Feature Plush with cool features and designs straight from a galaxy far far away. He's styled in his classic Mandalorian armor so that kids can create their own intergalactic adventures right at home. He's also ready for action: squeeze his pack and it launches a rocket right off his back. Colors and decorations may vary. • Create adventures from another galaxy with the Star Wars? Rocket Launching Boba Fett?! • The 12\"-tall plush features a removable pack that launches an included toy rocket when kids squeeze it. • Star Wars? memorabilia collectors will love this fun and unique character for play or display. • Inspired by the featured character Boba Fett? in Star Wars ?and Star Wars? The Mandalorian? the details are true to the franchise. • Star Wars? Rocket Launching Boba Fett? is a great gift for Star Wars? fans 3 years and older.",
    "Price": 29.99,
    "PictureUrl": "http://slimages.macys.com/is/image/MCY/products/0/optimized/21768004_fpx.tif",
    "CategoryId": 3,
    "BrandId": 3
  },
  {
    "Id": 21,
    "Name": "Marvel Avengers: Endgame Red Infinity Gauntlet Electronic Fist Roleplay",
    "Description": "Imagine the incredible super-powered action of the Avengers with figures roleplay and more inspired by Avengers: Endgame! This Infinity Gauntlet is inspired by the Avengers: Endgame movie part of the Marvel Cinematic Universe that includes Avengers: Infinity War. Avengers: Infinity War features characters like Iron Man Captain America Spider-Man Black Panther and more! With Avengers: Endgame -inspired toys kids can imagine battling like their favorite heroes and playing their part in saving the galaxy!  • INFINITY GAUNTLET WITH LIGHTS AND SOUNDS: Imagine controlling the universe for with the Infinity Gauntlet Electronic Fist featuring electronic lights and sound FX inspired by the Avengers: Endgame movie. • INSPIRED BY AVENGERS: ENDGAME: The Infinity Gauntlet Electronic Fist has lights and sounds so kids can imagine the action of the Avengers and their enemies. When kids push the center button the can light up an Infinity Stone or activate sound FX. • Ages 5 and up • WARNING: CHOKING HAZARD?Contains small parts. Not suitable for children under 3 years.",
    "Price": 22.99,
    "PictureUrl": "http://slimages.macys.com/is/image/MCY/products/0/optimized/20232895_fpx.tif",
    "CategoryId": 4,
    "BrandId": 2
  },
  {
    "Id": 22,
    "Name": "League of Legends, 6\" Zed Collectible Figure",
    "Description": "Bring your favourite League of Legends Champion home with the Official Zed 6\" League of Legends action figure. • WARNING - CHOKING HAZARD-contains small parts not suitable for children under 3 years • Age 12 years and above • Set includes - League of Legends Zed figure 2 Shuriken accessories • Product dimensions - 8.5\" L x 2.38\" W x 10\" H • Product weight - 0.71 lbs • Official League of Legends- collect the official League of Legends champion Zed - the Master of Shadows ruthless and without mercy Zed is a premium figure worthy of champions • Premium 6\" Zed figure- crafted with extreme details through mold finishes and sculpted textures. Premium paint and quality material finishes to bring your champion to life • 18 points of articulation- the League of Legends collectible figure has 18 points of articulation for poseability and stances • 2 epic accessories- includes 2 game-inspired premium accessories and thematic figure base. Zed comes with 2 high-quality shuriken weapon accessories • Assembly is not required",
    "Price": 20.99,
    "PictureUrl": "http://slimages.macys.com/is/image/MCY/products/0/optimized/23844888_fpx.tif",
    "CategoryId": 2,
    "BrandId": 4
  },
  {
    "Id": 23,
    "Name": "Pokemon Clip 'N' Go Toxel and Great Ball",
    "Description": "Bring your Pokemon battles to life anywhere you go. Features a Poke ball and a Pokemon figure. Got to catch them all. • Product dimensions - 5.5\" L x 3.25\" W x 8\" H • Product weight - 0.22 lbs • For ages 4 and above • Includes a highly detailed 2\" Toxel figure and a great poke ball • The perfect toy for any Pokemon fan • Poke balls clip on to any belt • Warning choking hazard - contains small parts not suitable for children under 3 years",
    "Price": 14.99,
    "PictureUrl": "http://slimages.macys.com/is/image/MCY/products/0/optimized/23276354_fpx.tif",
    "CategoryId": 3,
    "BrandId": 6
  },
  {
    "Id": 24,
    "Name": "Nerf Fortnite Flare",
    "Description": "The Nerf Fortnite flare blaster is inspired by the equipment used in Fortnite and captures the look of the one from the popular video game. The blaster features break-open dart loading. • Product dimensions - 11.75\" L x 2.63\" W x 10.5\" H • Product weight - 0.99 lbs • Includes blaster and 3 darts 3 Nerf mega darts - comes with 3 official Nerf mega foam darts that make a whistling sound as they fly through the air • Break-open dart loading - the front of the blaster swings open for you to access the chamber and load 1 dart inside. Close the blaster and get ready to battle • Pull-down priming handle - pull down the handle to prime the blaster then pull the trigger to launch a dart at your target • The Nerf Fortnite flare blaster includes 3 official Nerf mega darts that make a whistling sound as they fly through the air. Official Nerf mega foam darts are great for indoor and outdoor battles and are tested and approved for performance and quality • Hand-powered by you - no batteries needed • Eyewear recommended (not included) • Fortnite marks and copyright 2022 epic games Inc. Hasbro and all related terms are trademarks of Hasbro • Ages 8 and up to avoid eye injury • Do not aim at eyes or face. Use of eyewear recommended for players and people within range • Use only official Nerf darts. Other darts may not meet safety standards. Do not modify darts or blaster • Warning - choking hazard ? small parts may be generated • Not for children under 3 years",
    "Price": 16.99,
    "PictureUrl": "http://slimages.macys.com/is/image/MCY/products/0/optimized/21092250_fpx.tif",
    "CategoryId": 5,
    "BrandId": 7
  },
  {
    "Id": 25,
    "Name": "Nerf Rival Vision XXII-800",
    "Description": "They're the most accurate Nerf rival blasters and the most accurate Nerf rival rounds ever. The blasters have an adjustable rear sight to customize the configuration for improved aim. • Product dimensions - 16\" L x 2.63\" W x 11.25\" H • Product weight - 1.7 lbs • Includes blaster 8 rounds and instructions • The most accurate Nerf rival system - Nerf rival blasters have an adjustable sight optimized barrel and Nerf rival accu-rounds making it the most accurate Nerf rival system for advanced precision • Nerf rival vision xxii-800 blaster - with an 8-round integrated magazine draw-back priming bar and trigger lock. Fires rounds at a velocity of 90 feet per second • 8 Nerf rival accu-rounds - the most accurate Nerf rival rounds with an improved aerodynamic design and dimple pattern to provide more consistent flight. Compatible with all Nerf rival blasters • Line up the rear sight with the front edge-glow sight for the perfect shot • Eyewear recommended (not included) • No batteries required. Nerf and all related properties are trademarks of Hasbro • Ages 14 and up to avoid eye injury • Do not aim at eyes or face • Use of eyewear required for players and people within range. Use only official hyper rounds. Do not modify rounds or blaster • Warning - choking hazard - small parts may be generated. Not for children under 3 years",
    "Price": 21.99,
    "PictureUrl": "http://slimages.macys.com/is/image/MCY/products/0/optimized/21092246_fpx.tif",
    "CategoryId": 5,
    "BrandId": 7
  },
  {
    "Id": 26,
    "Name": "Nerf Elite 2.0 Flip Shots Flip-16 Blaster",
    "Description": "Nerf elite 2.0 flip shots flip-16 blaster features 16 barrels 8 facing front and 8 facing back. • Product dimensions - 24\" L x 3\" W x 11.63\" H • Weight - 1.91 lbs • Fire darts from the 8 front barrels then flip the rear barrels forward to keep on firing • 16-dart capacity and 16 Nerf darts - each of the barrels holds 1 dart for an 16-dart capacity total • The blaster comes with 16 official Nerf elite foam darts to fully load all 16 barrels • Pull handle to flip barrels - fire 8 darts in a row from the barrels that are facing front then pull the handle to flip the rear barrels forward and surprise the competition with another 8-dart blast • Fire 1 or 2 darts at a time - pull the trigger halfway to fire 1 dart or unleash 2 darts at a time by pulling the trigger all the way back • Bolt-action priming • Stock folds into a targeting sight • Warning - do not aim at eyes or face use of eyewear recommended for players and people within range use only official Nerf darts other darts may not meet safety standards do not modify darts or blaster • Warning - choking hazard - small parts may be generated not for children under 3 years",
    "Price": 22.43,
    "PictureUrl": "http://slimages.macys.com/is/image/MCY/products/0/optimized/19853730_fpx.tif",
    "CategoryId": 5,
    "BrandId": 7
  },
  {
    "Id": 27,
    "Name": "Nerf Roblox Adopt Me - Bees Blaster",
    "Description": "Nerf Roblox adopt me - bees dart blaster - this dart-firing blaster takes its inspiration from ones used in the Roblox game adopt me. • Product dimensions - 26\" L x 3.13\" W x 11.75\" H • Weight - 2.43 lbs • Exclusive virtual item code - this Nerf Roblox blaster includes a code that allows you to redeem an exclusive virtual item on Roblox • Lever action drum-fed dart blasting - the blaster features lever-action priming and an 8-dart rotating drum load the drum move the priming lever and pull the trigger to blast a dart at your targets • Includes 8 Nerf darts - includes 8 official Nerf elite darts that are made of foam - great for indoor and outdoor play • Warning - do not aim at eyes or face use of eyewear recommended for players and people within range use only official Nerf darts other darts may not meet safety standards do not modify darts or blaster • Warning - choking hazard - small parts may be generated not for children under 3 years",
    "Price": 33.99,
    "PictureUrl": "http://slimages.macys.com/is/image/MCY/products/0/optimized/19853711_fpx.tif",
    "CategoryId": 5,
    "BrandId": 7
  },
  {
    "Id": 28,
    "Name": "Nerf Ultra Two BlasterNerf Ultra Two Blaster",
    "Description": "Experience the ultimate in Nerf dart blasting. Nerf ultra blasters have advanced design and performance to deliver extreme distance accuracy and speed. • Product dimension - 3.13\" L x 14.5\" W x 9.5\" H • Product weight - 1.7 lbs • The ultimate in Nerf dart blasting- Experience extreme distance accuracy and speed with Nerf ultra blasters that are designed with advanced features to take your Nerf games to the next level • Nerf ultra darts are the farthest flying Nerf darts ever- Nerf ultra darts fly up to 120 feet 36 meters distances based on controlled testing and actual performance varies • Nerf ultra two motorized blaster with fast back reloading- The 6-dart cylinder is open in the back- facing you as you hold the blaster so you can reload quickly • 6 Nerf ultra darts- Includes 6 ground-breaking Nerf ultra darts that feature an innovative flight tip aerofin technology and lightweight Nerf ultra foam and they work only with Nerf ultra blasters • WARNING - Choking Hazard contains small parts and not suitable for children under 3 years",
    "Price": 27.99,
    "PictureUrl": "http://slimages.macys.com/is/image/MCY/products/0/optimized/21928077_fpx.tif",
    "CategoryId": 5,
    "BrandId": 7
  }
]
